def area(a):
    """Возвращает площадь квадрата по длине его стороны.

    Параметры:
        a (float | int): длина стороны квадрата.

    Возвращаемое значение:
        float | int: площадь квадрата.

    Пример вызова:
        >>> area(5)
        25
    """
    return a * a


def perimeter(a):
    """Возвращает периметр квадрата по длине его стороны.

    Параметры:
        a (float | int): длина стороны квадрата.

    Возвращаемое значение:
        float | int: периметр квадрата.

    Пример вызова:
        >>> perimeter(5)
        20
    """
    return 4 * a
